scripts/global/1011/32858606

<p>I have to transfer big files (500 MB+...can also be of 1GB in size). These files have to be base64 encoded and the encoded string has to be put in a XML file. While my below code works good for smaller files (30 - 50 MB) it fails for files great than 100 MB. I am using base64 encoder from SUN (sun.misc.BASE64Encoder).</p>  <pre><code>public void execute(InputStream inputstream, OutputStream outputstream) throws StreamTransformationException{         try         {             String sourceFileName = "test_file";             String ReceiverStr = "";             //2. Convert input data in Base64Encoded string             BASE64Encoder encoder = new BASE64Encoder();             byte input[] = new byte[inputstream.available()];              inputstream.read(input);             String base64Encoded = encoder.encode(input);             //3. Build the SOAP request format             String serverUrl = "http://website/url";              String soapEnvelope = "&lt;soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:soap=\"http://schemas.microsoft.com/sharepoint/soap/\"&gt;";             String soapHeader = "&lt;soapenv:Header/&gt;&lt;soapenv:Body&gt;&lt;soap:CopyIntoItems&gt;&lt;soap:SourceUrl&gt;C:\\Users\\Desktop\\test_file.txt&lt;/soap:SourceUrl&gt;&lt;soap:DestinationUrls&gt;&lt;soap:string&gt;" + serverUrl + "&lt;/soap:string&gt;&lt;/soap:DestinationUrls&gt;&lt;soap:Fields&gt;&lt;soap:FieldInformation " + "Type=" + "\"Text\"" + " DisplayName=\"" + sourceFileName + "\"" + " InternalName=\"" + sourceFileName + "\"" + " Id=\"deff4b5c-b727-414c-893d-c56a8e12455f\"" + " Value=\"" + sourceFileName + "\"/&gt;&lt;/soap:Fields&gt;";             String soapStream = "&lt;soap:Stream&gt;" + base64Encoded + "&lt;/soap:Stream&gt;";             ReceiverStr = soapEnvelope + soapHeader + soapStream + "&lt;/soap:CopyIntoItems&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;";             //4. Write the SOAP request to receiver channel             outputstream.write(ReceiverStr.getBytes());         }         catch(Exception e) {             throw new StreamTransformationException(e.toString());           }     } </code></pre>  <p>When I try to see the message at run-time, then the entire message is not displayed and it is truncated in-between in the base64Encoded string. Below is the error that is seen in my system on executing the JAVA code. <a href="http://i.stack.imgur.com/9vfmM.jpg" rel="nofollow"><img src="http://i.stack.imgur.com/9vfmM.jpg" alt="enter image description here"></a> Please note that my server settings can otherwise easily transfer 1GB+ files without any JAVA Heap size error or file truncation. Can you please let me know how can I process big files using above logic?</p>  <p>Thanks,</p>  <p>Abhishek.</p>